Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: This feature enables you to hide the implementation details of your code, and to specify a preferred interface through which that code can be accessed and used.
ja: この特徴によってあなたは、あなたのコードの実施詳細を隠すこと、そしてそれを通してそのコードがアクセスされ使用されることができる好ましいインタフェースを指定することが可能になります。

source: This feature is represented by a structure called Values, which is nested within the Rank enumeration:
ja: この特徴はValuesと呼ばれる構造体で表されます、それは、Rank列挙の内部で入れ子にされます：

source: This feature prevents the assignment operator (=) from being used by accident when the equal to operator (==) is actually intended.
ja: この特徴は、実際には同等演算子（==）が意図されるときに、偶然に代入演算子（=）が使われるのを防止します。

source: This form of the operator will always return an optional value, and the value will be nil if the downcast was not possible.
ja: 演算子のこの形式は、常にオプショナルの値を返します、そしてダウンキャストが可能でなかったならばその値はnilです。

source: This form of the operator will trigger a runtime error if you try to downcast to an incorrect class type.
ja: 演算子のこの形式は、あなたが適切でないクラス型へのダウンキャストをためすならば、実行時エラーを引き起こします。

source: This function doesn’t compile as written above.
ja: この関数は、上記のように書かれるとしてもコンパイルしません。

source: This function evaluates a plain number by simply returning the associated value.
ja: この関数は、普通の数字を単に関連値を返すことによって評価します。

source: This function makes use of in-out parameters to swap the values of a and b, as described in In-Out Parameters.
ja: この関数は、値aとbを交換するためにin-outパラメータの利用を行います、In-Outパラメータで記述されるように。

source: This function simply adds amount to runningTotal, and returns the result.
ja: この関数は、単にamountをrunningTotalに加えて、結果を返します。

source: This function takes a person’s name and whether they have already been greeted as input, and returns an appropriate greeting for that person:
ja: この関数は、人物の名前と彼らがすでに挨拶されたかどうかを入力として取って、ふさわしい挨拶をその人物に対して返します：

source: This function takes two arguments called someContainer and anotherContainer.
ja: この関数は、someContainerとanotherContainerと呼ばれる２つの引数をとります。

source: This function, printIntegerKinds(_:), takes an input array of Int values and iterates over those values in turn.
ja: この関数、printIntegerKinds(_:)は、Int値の配列の入力を取り、それらの値に最初から終わりまで順番に繰り返していきます。

source: This functionality is provided by the DataImporter class, which is assumed to take a nontrivial amount of time to initialize.
ja: この機能性はDataImporterクラスによって提供されます、それは、初期化するために瑣末でない量の時間がかかると仮定されます。

source: This future type can be referred to as Element anywhere within the structure’s definition.
ja: この将来の型は、構造体の定義の範囲内のどこででも「Element」として参照されることができます。

source: This future warning informs you that the library author added a new case to the enumeration that doesn’t have a corresponding switch case.
ja: この未来警告は、対応するスイッチケース節を持たない列挙にライブラリ作者がある新しいケース節を加えたことをあなたに告知します。

source: This generic subscript is constrained as follows:
ja: この総称体添え字は、以下のように制約されます：

source: This gives a reverse alphabetical sort, with "Barry" being placed before "Alex", and so on.
ja: これは、"Barry"が"Alex"の前に置かれるなどの、逆アルファベット順の分類を提供します。

source: This greeting is then passed back out of the function using the return keyword.
ja: この挨拶は、それからreturnキーワードを使用して逆に関数の外に渡されます。

source: This helps you remember that it’s possible to capture self by accident.
ja: これは、偶然にselfを捕らえることは可能であるのをあなたが忘れないことを手助けします。

source: This illustrates that the overall call to the sorted(by:) method has remained the same.
ja: これは、sorted(by:)メソッドへの呼び出し全体が、同じもののままだったことを図解します。

source: This implementation of HTMLElement is identical to the previous implementation, apart from the addition of a capture list within the asHTML closure.
ja: HTMLElementのこの実装は、asHTMLクロージャ内の捕獲リストの追加は別として、前の実装と同一です。

source: This implementation uses two triangles and a square, but the function could be rewritten to draw a trapezoid in a variety of other ways without changing its return type.
ja: この実装は、２つの三角形とある四角形を使います、しかし関数は、台形をさまざまな他の方法で描画するよう書き直されることがそれの戻り型を変更することなしにできました。

source: This includes String, as shown here, as well as collection types such as Array, Dictionary, and Set.
ja: これは、ここで示すようにStringを、それだけでなくArray、Dictionary、そしてSetといったコレクション型も含みます。

source: This includes a protocol with an associated type.
ja: これは、関連型を使うプロトコルを含みます。

source: This includes the ability to extend types for which you do not have access to the original source code (known as retroactive modeling).
ja: これは、あなたが元々のソース・コードにアクセスをしないで型を拡張する能力を含みます（遡及モデリングとして知られます）。

source: This initializer can be used to create a new Food instance with a specific name:
ja: このイニシャライザが、ある特定の名前を使って新しいFoodインスタンスをつくるために使われることができます：

source: This initializer checks if the species value passed to the initializer is an empty string.
ja: このイニシャライザは、イニシャライザに渡されるspecies値が空の文字列かどうか検査します。

source: This initializer has a parameter called generator, which is also of type RandomNumberGenerator.
ja: このイニシャライザは、generatorと呼ばれるパラメータを持ちます、それもまた、型RandomNumberGeneratorです。

source: This initializer has an empty body, represented by an empty pair of curly braces {}.
ja: このイニシャライザは、一対の空の波括弧{}によって表される空の本文を持ちます。

source: This initializer is described in more detail in Creating an Array with a Default Value.
ja: このイニシャライザは、更に詳細に配列を１つの初期値で作成するで記述されます。

source: This initializer is therefore inherited by RecipeIngredient.
ja: このイニシャライザは、したがって、RecipeIngredientによって継承されます。

source: This initializer simply assigns the origin and size argument values to the appropriate stored properties:
ja: このイニシャライザは、単に引数値originとsizeを適切な格納プロパティに代入します：

source: This initializer starts by assigning the passed quantity argument to the quantity property, which is the only new property introduced by RecipeIngredient.
ja: このイニシャライザは、渡されたquantity引数をquantityプロパティに代入することによって始めます、それは、RecipeIngredientによって導入される唯一の新しいプロパティです。

source: This is a constant value of 10 for all AudioChannel instances.
ja: これは、定数値で、全てのAudioChannelインスタンスのために10です。

source: This is a stored property with willSet and didSet observers.
ja: これは、willSetとdidSetオブザーバーを持つ格納プロパティです。

source: This is also a comment
ja: （これもコメントです）

source: This is because functions and closures are reference types.
ja: これは、関数とクロージャが参照型であるからです。

source: This is because of the copy-in copy-out memory model for in-out parameters: The value is always written back to the property at the end of the function.
ja: これは、in-outパラメータのための「コピーイン、コピーアウト」メモリーモデルが理由です：値は常に、その関数の終わりでプロパティへと書き込まれて戻されます。

source: This is because the type itself does not have an initializer that can assign a value to a stored type property at initialization time.
ja: これは、型それ自身には初期化時に値を格納型プロパティに代入することができるイニシャライザがないからです。

source: This is equivalent to a decimal value of 15.
ja: これは、10進の値の15に等しいです。

source: This is indicated by passing a value of 3 to the structure’s initializer as the value to use for the instance’s multiplier parameter.
ja: これは、値3をこの構造体のinitializerにインスタンスのmultiplierパラメータのために使う値として渡すことによって示されます。

source: This is indicated by setting the optional playerOne variable to nil, meaning “no Player instance.” At the point that this happens, the playerOne variable’s reference to the Player instance is broken.
ja: これはオプショナルのplayerOne変数に、「Playerインスタンスがない」ことを意味する、nilを設定することによって示されます。これが起こる時点で、playerOne変数のもつPlayerインスタンスへの参照は壊れています。

source: This is known as closing over those constants and variables.
ja: これは、そのような定数や変数をすっかりクローズする（閉じ込める）こととして知られています。

source: This is known as overloading the existing operators.
ja: 既存の演算子のオーバーロードとしてこれは知られています。

source: This is known as overriding.
ja: これは、オーバーライドとして知られています。

source: This is known as short-circuit evaluation.
ja: これは短絡評価として知られています。

source: This is known as a strong reference cycle.
ja: これは、強い参照循環として知られています。

source: This is necessary in order for it to be able to access the director or artist property of a Movie or Song for use in the description.
ja: これは、それがその説明で使う目的でMovieまたはSongのもつdirectorまたはartistプロパティにアクセス可能になるために必要です。

source: This is often done by assigning a literal value (or literal) to the constant or variable at the point that you declare it.
ja: これは、リテラル値（またはリテラル）を定数または変数に、あなたがそれを宣言する時点で代入することによって、しばしば行われます。

source: This is particularly true when you work with functions or methods that take functions as one or more of their arguments.
ja: １つ以上のそれの引数として関数をとる関数またはメソッドをあなたが扱うとき、これは特に当てはまります。

source: This is represented by the player’s coinsInPurse property:
ja: これは、プレーヤーのcoinsInPurseプロパティによって表されます：

source: This is simply an empty tuple, which is written as ().
ja: これは単に空のタプルです、それは()のように書かれます。

source: This is the end of the first multiline comment.
ja: （最初の複数行コメントの終わり。）

source: This is the same as 0xCC, which has a decimal value of 204.
ja: これは0xCCと同じものです、それは、10進の値の204を持ちます。

source: This is the second, nested multiline comment.
ja: （第二の入れ子の複数行コメント。）

source: This is the standard calling convention for function values in Swift.
ja: これは、スウィフトにおける関数値のための標準的な呼出規約です。

source: This is the start of the first multiline comment.
ja: （最初の複数行コメントの始まり。）

source: This is true even for constant stored properties, as described in Assigning Constant Properties During Initialization.
ja: 初期化の間に定数プロパティを割り当てるで記述されるように、これは定数格納プロパティにさえあてはまります。

source: This is true even if the new value is the same as the current value.
ja: これは、たとえ新しい値が現在の値と同じものであるとしても当てはまります。

source: This is true even if you are overriding an automatically provided default initializer, as described in Default Initializers.
ja: これは、省略時のイニシャライザで記述されるように、あなたが自動的に提供される省略時のイニシャライザをオーバーライドしている場合にさえもあてはまります。

source: This is true even though increment(forCount:) is defined as returning a non-optional Int value in the definition of CounterDataSource.
ja: たとえincrement(forCount:)がCounterDataSourceの定義の中で非オプショナルのInt値を返すように定義されるとしても、これは当てはまります。

source: This is true even though type method requirements are prefixed with the class or static keyword when implemented by a class:
ja: たとえ型メソッド要件がクラスによって実装されるときclassまたはstaticキーワードを前に置かれるとしても、これは当てはまります：

source: This is very similar to placing an exclamation point (!) after an optional value to force the unwrapping of its value.
ja: これは、その値を強制アンラップするためにオプショナルの値の後に感嘆符（!）を置くことに非常に似ています。

source: This is why increment(forCount:) is also written with a question mark after its name.
ja: これが、increment(forCount:)もまたその名前の後に疑問符を書かれる理由です。

source: This is why the m computed property returns self—the expression 1.m is considered to calculate a Double value of 1.0.
ja: これがm計算プロパティがselfを返す理由です ― 式1.mは、1.0のDouble値を計算するものと考えられます。

source: This keeps track of the maximum input value that has been received by any AudioChannel instance.
ja: これは、あらゆるAudioChannelインスタンスによって受け取られた最大入力値の情報を得続けます。

source: This key-value type matches the type of the airports variable declaration (a dictionary with only String keys, and only String values), and so the assignment of the dictionary literal is permitted as a way to initialize the airports dictionary with two initial items.
ja: この「キーと値」型は、airports変数の宣言の型（Stringのキーのみ、そしてStringの値のみをもつ辞書）に合致します、なのでこの辞書リテラルを代入することは、２つの最初の項目でairports辞書を初期化する方法として許されます。

source: This keyword indicates that the definition of the closure’s parameters and return type has finished, and the body of the closure is about to begin.
ja: このキーワードはクロージャのパラメータと戻り型の定義が終わったことを示します、そして、クロージャの本文はまさに開始しようとしています。

source: This kind of function call expression has the following form:
ja: この種類の関数呼び出し式は、以下の形式を持ちます：

source: This kind of function is known as a nested function.
ja: この種類の関数は、入れ子にされた関数として知られています。

source: This kind of range is called a one-sided range because the operator has a value on only one side.
ja: この種類の範囲は、片側範囲と呼ばれます、なぜならこの演算子は一方の側でのみ値を持つからです。

source: This kind of subscript is called a type subscript.
ja: この種の添え字は、型添え字と呼ばれます。

source: This lets you call the throwing function inside a do-catch statement and handle errors in the catch clause by throwing a different error.
ja: これは、あなたにスロー関数をdo-catch文の内部で呼び出させ、そのcatch節において異なるエラーをスローすることによって、エラーを取り扱わせます。

source: This list is transformed into a tree by applying operator precedence.
ja: このリストは、演算子優先順位を適用することによって、ツリー（木構造）に変えられます。

source: This makes for highly readable code when working with explicitly typed enumeration values.
ja: これは、明示的に型指定された列挙値を扱う場合に、非常に可読性の高いコードにします。

source: This makes it easy to create custom string values for display, storage, and printing.
ja: これは、表示、保存、そして出力するために個々の注文に応じた文字列値をつくることを簡単にします。

source: This makes the switch statement safer and easier to use than the one in C and avoids executing more than one switch case by mistake.
ja: これは、switch文をCのものよりも安全で使いやすくして、誤って複数のswitchケース節を実行することを防ぎます。

source: This matches the single requirement of the FullyNamed protocol, and means that Person has correctly conformed to the protocol.
ja: これは、FullyNamedプロトコルの唯一の要件に適合します、したがってそのPersonが正しくそのプロトコルに従ったことを意味します。

source: This matches the type of the shoppingList variable’s declaration (an array that can only contain String values), and so the assignment of the array literal is permitted as a way to initialize shoppingList with two initial items.
ja: これはshoppingList変数の宣言（String値を含むことだけができる配列）の型に合致します、それでこの配列リテラルの代入は、２つの最初の項目でshoppingListを初期化するためのやり方として認められます。

source: This means code like protoFlip(protoFlip(smallTriange)) that applies multiple transformations is invalid because the flipped shape isn’t a valid argument to protoFlip(_:).
ja: これは、複数の変換を適用するprotoFlip(protoFlip(smallTriange))のようなコードが無効であることを意味します、なぜなら裏返された形状はprotoFlip(_:)への有効な引数ではないからです。

source: This means it is possible to have precedence groups with undefined relative precedence.
ja: これが意味するのは、未定義の関係優先順位による優先順位グループを持つことは可能だということです。

source: This means that 4.75 becomes 4, and -3.9 becomes -3.
ja: これは、4.75が4に、そして-3.9が-3になることを意味します。

source: This means that SomeInternalClass and someInternalConstant can be written without an explicit access-level modifier, and will still have an access level of internal:
ja: これは、SomeInternalClassとsomeInternalConstantが明示的なアクセス水準修飾子なしで書かれることができ、それでもまだ内部のアクセス水準を持つことを意味します：

source: This means that a % b and a % -b always give the same answer.
ja: これは、a % bとa % -bが常に同じ答えを与えることを意味します。

source: This means that a defer statement can be used, for example, to perform manual resource management such as closing file descriptors, and to perform actions that need to happen even if an error is thrown.
ja: これはdefer文が、例えば、ファイル記述子を閉じることなどの手動リソース管理を実行するために、そしてたとえエラーがスローされるとしても起こることが必要な動作を実行するために使われることができるのを意味します。

source: This means that a change to the value of a in the outer scope does not affect the value of a in the inner scope, nor does a change to a inside the closure affect the value of a outside the closure.
ja: これが意味するのは、外側のスコープのaの値に対する変更は内側のスコープのaの値に影響を及ぼさない、そしてまたクロージャ内部のaに対する変更はクロージャ外部のaに影響を及ぼさないということです。

source: This means that a function can return another function as its value.
ja: これは、ある関数が別の関数をその値として返すことができるのを意味します。

source: This means that all of the information needed to infer an omitted type or part of a type in an expression must be accessible from type-checking the expression or one of its subexpressions.
ja: これは、ある式における省略される型や型の一部分を推論するために必要とされる情報のすべては、型を調べているその式またはそれの下位式の１つからアクセス可能でなければならないことを意味します。

source: This means that any structure and enumeration instances you create—and any value types they have as properties—are always copied when they are passed around in your code.
ja: これは、あなたがつくるあらゆる構造体や列挙のインスタンス ― そして、それらがプロパティとして持つあらゆる値型 ― は、あなたのコードの中であちこち渡される時に常にコピーされることを意味します。

source: This means that classes have additional responsibilities for ensuring that all stored properties they inherit are assigned a suitable value during initialization.
ja: これは、クラスが、それが継承する全ての格納プロパティが初期化の間に適切な値を代入されることを確実にすることに対する追加の責任を持つことを意味します。

source: This means that code that would otherwise run immediately after the call is never executed.
ja: これが意味するのは、そうでなければ呼び出しの直後に動作するコードは、決して実行されないということです。

source: This means that different characters—and different representations of the same character—can require different amounts of memory to store.
ja: これは異なる文字—さらに同じ文字の異なる表現—が、格納するために異なる量のメモリを必要とすることがあるのを意味します。

source: This means that in the example above, array3D[0] refers to [[1, 2], [3, 4]], array3D[0][1] refers to [3, 4], and array3D[0][1][1] refers to the value 4.
ja: これは、上の例で、array3D[0]は[[1, 2], [3, 4]]に言及し、array3D[0][1]は[3, 4]に言及し、そしてarray3D[0][1][1]は値４に言及することを意味します。

source: This means that it returns a function, rather than a simple value.
ja: これは、それが関数を返すことを意味します、単純なひとつの値ではなく。

source: This means that the Country initializer can start to reference and pass around the implicit self property as soon as the name property is set.
ja: これはCountryイニシャライザが、nameプロパティが設定されるとすぐに、暗黙のselfプロパティに基づいて参照したり渡したりを可能であるのを意味します。

source: This means that the capitalCity property has a default value of nil, like any other optional, but can be accessed without the need to unwrap its value as described in Implicitly Unwrapped Optionals.
ja: これは、capitalCityプロパティが、オプショナルの他のものの様に、nilの省略時の値を持つが、アンラップする必要なしでその値にアクセスされることができることを意味します、暗黙的にアンラップされるオプショナルで記述されるように。

source: This means that the (String, String) and Bool types do not need to be written as part of the closure expression’s definition.
ja: これは、(String, String)およびBool型が、クロージャ式の定義の一部として書かれる必要がないことを意味します。

source: This means that the letter "B" is “greater than” the letter "A", and the string "Tom" is greater than the string "Tim".
ja: これは文字"B"は文字"A"「より大きい」こと、そして文字列"Tom"は文字列"Tim"よりも大きいことを意味します。

source: This means that the value is allowed to outlive the lifetime of the call.
ja: これは、その値が呼び出しのライフタイムより長生きするのを許されることを意味します。

source: This means that they return a value of (), or an empty tuple.
ja: これは、それらが値()、または空のタプルを返すことを意味します。

source: This means that when you break the strong reference held by the john variable by setting it to nil, there are no more strong references to the Person instance:
ja: これは、あなたがjohn変数によって保持される強い参照を、それをnilに設定することによって壊すとき、Personインスタンスへの強い参照がもうそれ以上ないことを意味します：

source: This means that you can change (or mutate) the collection after it’s created by adding, removing, or changing items in the collection.
ja: これは、あなたがコレクションを変更する（または変化させる）ことが、それが作成された後にそのコレクション中の項目を追加、削除、または変更することによって可能なのを意味します。

source: This means that you can extend Array to conform to the Container protocol simply by declaring that Array adopts the protocol.
ja: これは、あなたがArrayを拡張してContainerプロトコルに準拠することが、Arrayがそのプロトコルを採用すると宣言することによって可能であることを意味します。

source: This means that you can use self to disambiguate between type properties and type method parameters, just as you do for instance properties and instance method parameters.
ja: これはあなたが型プロパティと型メソッドパラメータの間で曖昧さをなくすためにselfを使うことができることを意味します、ちょうどあなたがインスタンスプロパティとインスタンスメソッドパラメータでするように。

source: This means that you cannot access any other property values from within your closure, even if those properties have default values.
ja: これは、たとえそれらのプロパティには省略時の値があるとしても、あなたがあなたのクロージャ内から他のどのプロパティ値にもアクセスすることができないことを意味します。

source: This means that you cannot insert a value of the wrong type into a collection by mistake.
ja: これは、あなたが間違った型の値を誤ってあるコレクションの中に入れることが不可能なことを意味します。

source: This means that you can’t accidentally access methods or properties that the class implements in addition to its protocol conformance.
ja: これは、クラスがそれのプロトコル準拠にさらに加えて実装するメソッドやプロパティにあなたが偶然にアクセスすることができないことを意味します。

source: This means that you can’t change the value of a parameter by mistake.
ja: これは、あなたが誤ってパラメータの値を変えることができないことを意味します。

source: This means there are two write accesses to playerInformation with durations that overlap, causing a conflict.
ja: これは、２つの書き込みアクセスがplayerInformationに対してオーバーラップする期間に存在して、衝突を起こしていることを意味します。

source: This means you always get great performance when working with strings as value types.
ja: これは、値型として文字列を扱うとき、あなたは常に非常に大きいパフォーマンスを得ることを意味します。

source: This means you can use as many assertions as you want during your development process, without impacting performance in production.
ja: これが意味するのは、あなたは多くの表明をあなたが望むだけあなたの開発過程の間に使用できる、製品での性能に影響を与えることなしに、ということです。

source: This means you can use constants to name a value that you determine once but use in many places.
ja: これは、あなたが一度だけ決定するが多くの場所で使用する値に対して名前をつけるために定数を利用できるのを意味します。

source: This means, if you have a large project that’s divided into multiple frameworks, you can migrate your code from Swift 4 to Swift 5.2 one framework at a time.
ja: これは、あなたが複数のフレームワークへと分割される巨大なプロジェクトを持つならば、あなたはあなたのコードをSwift 4からSwift 5.2へと１度に１フレームワークずつ移行できるのを意味します。

source: This means, if you import Foundation, you can access those NSString methods on String without casting.
ja: これが意味するのは、あなたがFoundationをインポートするならば、あなたはそれらNSStringメソッドにString上でキャストなしでアクセスできるという事です。

source: This memory holds information about the type of the instance, together with the values of any stored properties associated with that instance.
ja: このメモリは、インスタンスの型に関する情報を、そのインスタンスと結びつけられるあらゆる格納プロパティの値と共に持ちます。

source: This method calls the generator’s random() method to create a new random number between 0.0 and 1.0, and uses this random number to create a dice roll value within the correct range.
ja: このメソッドは、0.0と1.0の間で新しい乱数をつくるgeneratorのrandom()メソッドを呼んで、この乱数を正しい範囲内でさいころを振った値をつくるために使います。

source: This method checks the properties of the address and returns buildingName if it has a value, or buildingNumber concatenated with street if both have values, or nil otherwise.
ja: このメソッドは、アドレスのプロパティを調べて、それが値を持つならばbuildingNameを、または両方とも値を持つならばbuildingNumberに繋げてstreetを、またはそれ以外ではnilを返します。

source: This method does not actually do anything for a base Vehicle instance, but will be customized by subclasses of Vehicle later on:
ja: このメソッドは実際に何かを基盤Vehicleインスタンスのために行うわけではありません、しかし後でVehicleのサブクラスによって目的に合わせて作り変えられます：

source: This method does not specify a return type.
ja: このメソッドは、戻り型を指定しません。

source: This method removes the item at the specified index and returns the removed item (although you can ignore the returned value if you do not need it):
ja: このメソッドは、指定されたインデックスでの項目を取り除いて、取り除かれた項目を返します（けれども、あなたがそれを必要としないならば、返された値を無視することができます）：

source: This method removes the key-value pair if it exists and returns the removed value, or returns nil if no value existed:
ja: このメソッドは、それが存在するならば「キーと値」の対を削除して、削除された値を返します、または値が存在しないならばnilを返します：

source: This method returns a value of type String?.
ja: このメソッドは、型String?の値を返します。

source: This method unlocks the next level for all players and updates the player’s progress to move them to the next level.
ja: このメソッドは、全てのプレーヤーたちのために次のレベルの錠をあけて、プレーヤーの進捗をかれらを次のレベルへ移動するために更新します。

source: This might be a description of itself, or a text version of its current state:
ja: これは、それ自身の説明、またはテキスト版のそれの現在の状態であるかもしれません：

source: This might be because a DataImporter instance needs to open a file and read its contents into memory when the DataImporter instance is initialized.
ja: これは、DataImporterインスタンスが初期化されるとき、DataImporterインスタンスがファイルを開いてメモリーにその内容を読む必要があるからでしょう。

source: This modification tracking is implemented with a didSet property observer on the value property, which increments numberOfEdits every time the value property is set to a new value.
ja: この修正追跡は、didSetプロパティオブザーバーとしてvalueプロパティ上で実行されます、それは、numberOfEditsをvalueプロパティが新しい値に設定されるたびに増加させます。

source: This new isTop(_:) method first checks that the stack isn’t empty, and then compares the given item against the stack’s topmost item.
ja: この新しいisTop(_:)メソッドは、まずスタックが空でないことを確認します、それから与えられた項目をスタックの持つ最も上の項目と比較します。

source: This new startsWith(_:) method can be used with any type that conforms to the Container protocol, including the stacks and arrays used above, as long as the container’s items are equatable.
ja: この新しいstartsWith(_:)メソッドはContainerプロトコルに準拠するあらゆる型で使われることができます、上で使われるスタックと配列を含めて、コンテナの持つ項目が同等評価可能である限りは。

source: This new default can still be overridden within the extension for individual type members.
ja: この新しい省略時設定はさらに、個々の型メンバーのために拡張内でオーバーライドされることができます。

source: This new initializer starts by calculating an appropriate origin point based on the provided center point and size value.
ja: この新しいイニシャライザは、提供されたcenter点とsize値に基づいて適切な起源点を計算することによって始めます。
